spec/dummy/app/controllers/order_items_controller.rb

  def load_order_item
    @order_item = OrderItem.find params.require(:id)
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", 21]]